/*
*
* ÎÄ¼þÃû³Æ	£º	PX2TimerTask.cpp
*
*/

#include "PX2TimerTask.hpp"
using namespace PX2;

//----------------------------------------------------------------------------
TimerTask::TimerTask()
	:
mLastExecution(0),
mIsCancelled(false)
{
}
//----------------------------------------------------------------------------
TimerTask::~TimerTask()
{
}
//----------------------------------------------------------------------------
void TimerTask::Cancel()
{
	mIsCancelled = true;
}
//----------------------------------------------------------------------------